; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image6 - mode
	thermograph2 - mode
	infrared4 - mode
	spectrograph5 - mode
	thermograph3 - mode
	infrared0 - mode
	spectrograph7 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 image6)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph7)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 infrared4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument4 image6)
	(supports instrument4 spectrograph5)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star1)
	(supports instrument5 image6)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
)
(:goal (and
	(have_image Phenomenon7 spectrograph5)
	(have_image Phenomenon8 infrared0)
	(have_image Planet9 infrared4)
	(have_image Planet10 spectrograph1)
	(have_image Star11 spectrograph7)
))

)

; plan
1. (turn_to satellite3 groundstation5 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 groundstation5)
   goals met: 0 of 5
2. (turn_to satellite2 groundstation3 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 5
4. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 5
5. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 5
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
7. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 5
8. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 5
9. (calibrate satellite3 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 5
10. (turn_to satellite0 star11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star11)
   goals met: 0 of 5
11. (take_image satellite0 star11 instrument0 spectrograph7)
   added: (have_image star11 spectrograph7)
   goals met: 1 of 5
12. (turn_to satellite2 planet9 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet9)
   goals met: 1 of 5
13. (take_image satellite2 planet9 instrument3 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 2 of 5
14. (turn_to satellite3 phenomenon7 groundstation5)
   deleted: (pointing satellite3 groundstation5)
   added: (pointing satellite3 phenomenon7)
   goals met: 2 of 5
15. (take_image satellite3 phenomenon7 instrument4 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 3 of 5
16. (turn_to satellite3 phenomenon8 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon8)
   goals met: 3 of 5
17. (take_image satellite3 phenomenon8 instrument4 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 4 of 5
18. (turn_to satellite3 planet10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet10)
   goals met: 4 of 5
19. (take_image satellite3 planet10 instrument4 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 5 of 5
